# Brewfile packages
# Setup Cask to install Apps via homebrew.
tap 'homebrew/homebrew-cask'
tap 'homebrew/cask-versions'
# tap 'homebrew/versions'
tap 'homebrew/services'
# tap 'homebrew/dupes'

# Replace OSX binaries with GNU binaries.
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'go'
# brew 'dep'
brew 'grep'
brew 'gzip'
brew 'htop'
brew 'screen'
brew 'tree'
brew 'watch'
brew 'wdiff'
brew 'wget'

# OS X ships a GNU version, but too old
brew 'bash'
brew 'bash-completion2'
brew 'bash-completion'
brew 'emacs'
# brew 'gdb'
brew 'gpatch'
brew 'm4'
brew 'make'

# Other commands (non-GNU)
brew 'file-formula'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'less'
brew 'mas'
brew 'openssh'
brew 'perl'
brew 'python'
brew 'python3'
brew 'pipx'
brew 'p7zip'
brew 'rsync'
brew 'svn'
brew 'unzip'
brew 'vim'
brew 'zsh'
brew 'yt-dlp'
brew 'rust'
brew 'rustup'

# Useful Applications
brew 'asciinema'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'firefox'
cask 'karabiner-elements'
cask 'discord'
cask 'keepassxc'
cask 'gpg-suite'
cask 'keka'
cask 'kekaexternalhelper'
cask 'signal'
cask 'slack'
cask 'spectacle'
cask 'steam'
cask 'veracrypt'
cask 'google-chrome'
brew 'gron'
cask 'iterm2'
cask 'insomnia'
cask 'postman'
cask 'visual-studio-code'
cask 'vlc'
cask 'ffmpeg'
cask 'libreoffice'
cask 'audacity'

